php = PHP\ub294 \uc6d0\ub798 \uc6f9 \uac1c\ubc1c\uc744 \uc704\ud574 \ub3d9\uc801 \uc6f9 \ud398\uc774\uc9c0\ub97c \uc0dd\uc131\ud558\ub294 \ubc94\uc6a9 \uc11c\ubc84\uce21 \uc2a4\ud06c\ub9bd\ud305 \uc5b8\uc5b4\uc774\ub2e4. \uc778\uae30\uc788\ub294 \uac1c\ubc1c \ud504\ub808\uc784\uc6cc\ud06c\ub294 CakePHP, Zend,Symfony \uadf8\ub9ac\uace0 Code Igniter \uc774\ub2e4.
jenkins = jenkins\ub294 OpenPaas\uc758 \uc9c0\uc18d\uc801\uc778 \ud1b0\ud569\ud234(CI) \uc774\ub2e4. \uc790\uc138\ud55c \uc815\ubcf4\ub294 http://jenkins-ci.org/ \uc5d0 Version 1.509 \uc774\uc0c1\ub97c \ucc38\uc870 \ud558\uc138\uc694.
nodejs = node.js\ub294 \ube60\ub974\uace0 \uc27d\uac8c \ud655\uc7a5 \uac00\ub2a5\ud55c \ub124\ud2b8\uc6cc\ud06c \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc744 \uad6c\ucd95\ud558\uae30 \uc704\ud55c \ud06c\ub86c\uc758 \uc790\ubc14 \uc2a4\ud06c\ub9bd\ud2b8 \ub7f0\ud0c0\uc784\uc5d0 \ub0b4\uc7a5 \ub41c \ud50c\ub7ab\ud3fc \uc785\ub2c8\ub2e4. Node.js\ub294 \ubd84\uc0b0 \uc7a5\uce58\uc5d0\uc11c \uc2e4\ud589\ud558\ub294 \ub370\uc774\ud130 \uc9d1\uc57d\uc801\uc778 \uc2e4\uc2dc\uac04 Application\uc5d0 \uc801\ud569\ud569\ub2c8\ub2e4.
perl = Perl\uc740 \uace0 \uc218\uc900, \ubc94\uc6a9, \uc778\ud130\ud504\ub9ac\ud2b8, \ub3d9\uc801 \ud504\ub85c\uadf8\ub798\ubc0d \uc5b8\uc5b4\uc774\ub2e4. \uc6f9 \uc694\uccad\uc5d0 \ub300\ud55c \uc751\ub2f5\uc73c\ub85c Perl \uc2a4\ud06c\ub9bd\ud2b8\uc5d0 \uc0dd\uc131\ub41c \ub3d9\uc801 \ucee8\ud150\uce20\ub97c \uc81c\uacf5\ud55c\ub2e4.
jboss = \ucc28\uc138\ub300, \uace0 \uc218\uc900\uc758 \ud2b8\ub79c\uc7ad\uc158 \uc5d4\ud130\ud504\ub77c\uc774\uc988 \uc790\ubc14 \uc5b4\ud50c\ub9ac\ucf00\uc774\uc158\uc744 \uc704\ud574 \uc2dc\uc7a5\uc744 \uc120\ub3c4\ud558\ub294 \uc624\ud508 \uc18c\uc2a4 \uc5d4\ud130\ud504\ub77c\uc774\uc988 \ud50c\ub7ab\ud3fc\uc774\ub2e4. \ud074\ub77c\uc6b0\ub4dc\uc548\uc5d0 \uc5d4\ud130\ud504\ub77c\uc774\uc988 \uc790\ubc14\ub97c \ube4c\ub4dc \ubc0f \ubc30\ud3ec \ud569\ub2c8\ub2e4.
python = python\uc740 \uac00\ub3c5\uc131\uc744 \uac15\uc870, \ubc94\uc6a9, \uace0 \uc218\uc900\uc758 \ud504\ub85c\uadf8\ub798\ubc0d \uc5b8\uc5b4\uc774\ub2e4. \uc778\uae30\uc788\ub294 \uac1c\ubc1c \ud504\ub808\uc784\uc6cc\ud06c\ub294 Django, Bottle, Pylons,Zope \uadf8\ub9ac\uace0 TurboGears \uc785\ub2c8\ub2e4.
ruby = Ruby\ub294 \ub3d9\uc801 \ubc94\uc6a9 \uac1d\uccb4 \uc9c0\ud5a5 \ud504\ub85c\uadf8\ub798\ubc0d \uc5b8\uc5b4\uc774\ub2e4. \uc778\uae30 \uc788\ub294 \uac1c\ubc1c \ud504\ub808\uc784\uc6cc\ud06c\ub85c\ub294 Ruby on Rails \uadf8\ub9ac\uace0 Sinatra \uc785\ub2c8\ub2e4.
diy = OpenPaas\uc5d0\uc11c \uc9c0\uc6d0\ud558\uc9c0 \uc54a\ub294 \uc5b8\uc5b4, \ud504\ub808\uc784\uc6cc\ud06c, \ubc0f \ubbf8\ub4e4\uc6e8\uc5b4 \ub97c \uc704\ud574 \uc9c0\uc6d0 \ub41c\ub2e4. \ucd94\uac00 \ud558\uace0 \uc2f6\uc740 \ud504\ub808\uc784\uc6cc\ud06c\ub97c \uac00\uc800\uc624\ub294 \uc608\ub294 OpenShift Community \ub97c \ucc38\uc870\ud558\uc138\uc694.
tomcat = Jsp \uc640 Servlet\ub97c \uae30\ubc18\uc73c\ub85c \ud558\ub294 \ub300\uaddc\ubaa8 \uacbd\ub7c9 Web Application\ub97c \uc704\ud55c \uc5d4\ud130\ud504\ub77c\uc774\uc988 \uae09 \uc790\ubc14 \uc6f9 \ucee8\ud14c\uc774\ub108\uc774\ub2e4.
egov = \uc804\uc790 \uc815\ubd80 \ud504\ub808\uc784\uc6cc\ud06c\uc758 \uc6f9 \ud504\ub85c\uc81d\ud2b8\uc758 \ud15c\ud50c\ub9bf\uc744 \uae30\ubc18\uc73c\ub85c Tomcat\uc5d0\uc11c \ube4c\ub4dc \ubc0f \ubc30\ud3ec \ub418\ub3c4\ub85d \uad6c\uc131\ub418\uc5b4\uc838 \uc788\uc2b5\ub2c8\ub2e4. 